#include <string>
#include <set>
#include <map>

#include "main.h"

#define DIRECTINPUT_VERSION 0x0800
#include <dinput.h>
//#if defined USE_SCRIPT_EXTENDER
//#include "Hooks_DirectInput8Create.h"
#include <queue>

#include "locks.h"
#include "memory.h"
#include "simpleheap.h"
#include "settings.h"

#include <shlobj.h>
#include <shlwapi.h>

void message( const char *format, ... );

class MemoryHeap;

SR_HEAP heap_SimpleHeap1 = {
	SimpleHeap1::allocate,
	SimpleHeap1::deallocate,
	SimpleHeap1::reallocate,
	SimpleHeap1::get_size,
	SimpleHeap1::is_in_heap_fast,
	SimpleHeap1::is_in_heap,
	SimpleHeap1::init,
	NULL,
	NULL,
	NULL,
	NULL,
};
SR_HEAP heap_ThreadHeap2 = {
	ThreadHeap2::allocate,
	ThreadHeap2::deallocate,
	ThreadHeap2::reallocate,
	ThreadHeap2::get_size,
	ThreadHeap2::is_in_heap_fast,
	NULL,//ThreadHeap2::is_in_heap,
	ThreadHeap2::init,
	NULL,
	NULL,
	NULL,
	NULL,
};
SR_HEAP heap_ThreadHeap3 = {
	ThreadHeap3::allocate,
	ThreadHeap3::deallocate,
	ThreadHeap3::reallocate,
	ThreadHeap3::get_size,
	ThreadHeap3::is_in_heap_fast,
	NULL,//ThreadHeap3::is_in_heap,
	ThreadHeap3::init,
	ThreadHeap3::get_bytes_used,
	NULL,
	NULL,
	NULL,
};
SR_HEAP heap_Windows = {
	malloc,
	free,
	realloc,
	_msize,
	NULL,//is_in_heap_fast,
	NULL,//is_in_heap,
	NULL,//init,
	NULL,
	NULL,
	NULL,
	NULL,
};
SR_HEAP heap_Oblivion = {
	allocate_from_memoryheap,
	free_to_memoryheap,
	realloc_from_memoryheap,
	NULL,//get_size
	NULL,//is_in_heap_fast
	NULL,//is_in_heap,
	NULL,//init
	NULL,
	NULL,
	NULL,
	NULL,
};
SR_HEAP heap = heap_Oblivion;

#if 0
class MemoryHeap
{
public:
/*	MemoryHeap(UInt32 mainSize, UInt32 unk1);
	
	void *	Allocate(UInt32 size, UInt32 unk);
	void	Free(void * ptr);

	void	CreatePool(UInt32 entrySize, UInt32 totalSize);

	bool	IsMainHeapAllocation(void * ptr);*/
	
	virtual void	Unk_0(UInt32 unk0);
	virtual void *	AllocatePage(UInt32 size);
	virtual void *	RawAlloc(UInt32 unk0);
	virtual void *	RawAlloc2(UInt32 unk0);
	virtual void	FreeMemory(void * buf);
	virtual void	RawFree(void * buf);
	virtual void	RawFree2(void * buf);
	virtual UInt32	RawSize(void * buf);
	
	// memory panic callback
	typedef void (* Unk164Callback)(UInt32 unk0, UInt32 unk1, UInt32 unk2);
	
//	void	** _vtbl;	// 000
	UInt32	field_004;	// 004 - alignment
	UInt32	field_008;	// 008
	UInt32	field_00C;	// 00C - size of main memory block
	UInt32	field_010;	// 010
	UInt32	field_014;	// 014
	void	* field_018;	// 018 - main memory block
	UInt32	field_01C;	// 01C
	UInt32	field_020;	// 020
	UInt32	field_024;	// 024
	UInt32	field_028;	// 028
	UInt32	field_02C;	// 02C
	UInt32	field_030;	// 030 - size of field_034 / 8
	void	* field_034;	// 034 - 0x2000 byte buffer
	void	* field_038;	// 038 - end of field_034
	UInt32	field_03C;	// 03C
	UInt32	field_040;	// 040
	void	* field_044;	// 044 - 0x80 byte buffer?
	UInt32	field_048;	// 048
	UInt32	field_04C;	// 04C
	UInt32	field_050;	// 050
	UInt32	field_054;	// 054 - available memory at startup
	UInt32	field_058;	// 058
	UInt32	field_05C;	// 05C
	UInt32	field_060;	// 060
	UInt32	field_064;	// 064
	UInt32	unk_068[(0x164 - 0x068) >> 2];	// 068
	Unk164Callback	field_164;	// 164
	UInt32	field_168;	// 168 - used memory at startup
	UInt8	field_16C;	// 16C
	UInt8	field_16D;	// 16D
	// 16E
};

STATIC_ASSERT(offsetof(MemoryHeap, field_16D) == 0x16D);

class MemoryPool
{
public:
	MemoryPool(UInt32 entrySize, UInt32 totalSize, const char * name);
	~MemoryPool();
	
/*	void *	Allocate(void);
	bool	IsMember(void * buf)
	{
		if(!field_040) return false;
		if(buf < field_040) return false;
		if(buf >= ((UInt8 *)field_040) + field_110) return false;

		return true;
	}*/

	struct FreeEntry
	{
		FreeEntry	* prev;
		FreeEntry	* next;
	};
	
	char	m_name[0x40];	// 000
	void	* field_040;	// 040 - base buffer
	FreeEntry	* freeList;	// 044

	UInt32	unk_048[(0x080 - 0x048) >> 2];	// 048

	CRITICAL_SECTION	critSection;	// 080

	UInt32	unk_098[(0x100 - 0x098) >> 2];	// 098

	UInt32	field_100;	// 100 - entry size
	UInt32	field_104;	// 104
	UInt16	* field_108;	// 108 - page allocation count (FFFF - unallocated)
	UInt32	field_10C;	// 10C - size of field_108 (in UInt16s)
	UInt32	field_110;	// 110 - total size
	UInt32	field_114;	// 114 - free elements
	UInt32	field_118;	// 118
	// 11C
};
STATIC_ASSERT(offsetof(MemoryPool, field_118) == 0x118);
#endif




#if OBLIVION_VERSION == OBLIVION_VERSION_1_2_416
//	void * (WINAPI * const Oblivion_MemoryHeap_Allocate)(int size) = (void * (WINAPI *)(int  )) 0x00401AA0;
//	void * const Oblivion_MemoryHeap_AllocateB = (void *) 0x00401ABA;
//	void * const Oblivion_MemoryHeap_AllocateC = (void *) 0x00401AA9;
//	void * (WINAPI * const Oblivion_MemoryHeap_Free    )(void *p ) = (void * (WINAPI *)(void*)) 0x00401D40;
//	void * const Oblivion_MemoryHeap_FreeB = (void *) 0x00401D50;
//	void * (WINAPI * const Oblivion_MemoryPool_Allocate)(        ) = (void * (WINAPI *)(     )) 0x00402480;
//	void * (WINAPI * const Oblivion_MemoryPool_Free    )(void *p ) = (void * (WINAPI *)(void*)) 0x00402600;
//	void * (WINAPI * const Oblivion_MemoryHeap_Unk     )(int size) = (void * (WINAPI *)(int  )) 0x009816F9;
//	void * (WINAPI * const Oblivion_MemoryHeap_RawFree )(int size) = (void * (WINAPI *)(int  )) ;
